publish/cpp/platform_across.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-12-04 Fri 23:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>跨平台开发的一些心得</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Brook Zhang" />
</head>
<body>
<div id="content">
<h1 class="title">跨平台开发的一些心得</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org204e29d">1. 概述</a></li>
<li><a href="#org756179e">2. Socket</a>
<ul>
<li><a href="#org5110fce">2.1. 头文件</a></li>
<li><a href="#org8939737">2.2. socket变量类型</a></li>
<li><a href="#orge1797ff">2.3. send 方法</a></li>
<li><a href="#org08b2201">2.4. socket关闭函数</a></li>
<li><a href="#orgd3e7ffb">2.5. 设置阻塞/非阻塞</a></li>
<li><a href="#org890cfab">2.6. 不同的错误码</a></li>
</ul>
</li>
<li><a href="#org4d8966f">3. 获取错误码</a></li>
<li><a href="#org8d8c882">4. 多线程</a>
<ul>
<li><a href="#org775a553">4.1. pthreadVC 库</a></li>
<li><a href="#org185508a">4.2. CreateThread</a></li>
<li><a href="#org7650056">4.3. C++ STL</a></li>
</ul>
</li>
<li><a href="#org814a313">5. 时间相关</a></li>
<li><a href="#org7860a06">6. usleep</a></li>
<li><a href="#org8bbcb4f">7. Timer</a></li>
</ul>
</div>
</div>

<div id="outline-container-org204e29d" class="outline-2">
<h2 id="org204e29d"><span class="section-number-2">1</span> 概述</h2>
<div class="outline-text-2" id="text-1">
<blockquote>
<p>
因为自己平时的主要工作是做SDK开发，涉及到不同平台的开发，主要是有Linux，Windows, Android, iOS 和 MacOS，看着挺多的其实主要分为POSIX阵营和对POSIX支持不算太好的Windows阵营，或者说类Linux阵营和windows阵营。
工作中跟平台相关的一些特性大体总结为：Socket，多线程相关，时间（高精度），Timer。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org756179e" class="outline-2">
<h2 id="org756179e"><span class="section-number-2">2</span> Socket</h2>
<div class="outline-text-2" id="text-2">
<blockquote>
<p>
对于Windows，Socket 需要依赖 Windows下的 Ws2_32.lib库，可以使用 #pragma comment(lib,"Ws2_32") 代码或者在工程中（VS，CMakeLists.txt）配置来告诉编译器对它的链接。
使用Socket前需要使用WSAStartup来启动Ws2_32.lib，并在停止使用是调用WSACleanup函数。
Linux就没有这么麻烦了。
除此之外，大部分接口的使用方式是一致的。下面简单说明一下不同之处：
</p>
</blockquote>
</div>
<div id="outline-container-org5110fce" class="outline-3">
<h3 id="org5110fce"><span class="section-number-3">2.1</span> 头文件</h3>
<div class="outline-text-3" id="text-2-1">
<blockquote>
<p>
Windows下需要依赖winsock.h或winsock2.h, 其中winsock2.h是winsock.h的升级版。
Linux下则分的细致一些：sys/socket.h, netinet/in.h, unistd.h。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org8939737" class="outline-3">
<h3 id="org8939737"><span class="section-number-3">2.2</span> socket变量类型</h3>
<div class="outline-text-3" id="text-2-2">
<blockquote>
<p>
Windows下Socket的变量类型是SOCKET, 通过查看系统定义，我们会发现它本质上是一个unsigned int.
Linux下用int就可以了，非常符合Linux一切皆描述符的思想。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orge1797ff" class="outline-3">
<h3 id="orge1797ff"><span class="section-number-3">2.3</span> send 方法</h3>
<div class="outline-text-3" id="text-2-3">
<blockquote>
<p>
对于send方法的最后一个参数，Windows下一般设置成0即可。
Linux下则建议设置成MSG_NOSIGNAL, 否则发送出错的话会向系统发送异常信号，如果不处理，则系统会BrokePipe，导致程序异常退出。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org08b2201" class="outline-3">
<h3 id="org08b2201"><span class="section-number-3">2.4</span> socket关闭函数</h3>
<div class="outline-text-3" id="text-2-4">
<blockquote>
<p>
windows下用closesocket(SOCKET)函数.
linux下用close(int)方法.
通常我们在Windows下写个宏，定义close 为 closesocket.这样Code都不用修改了。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-orgd3e7ffb" class="outline-3">
<h3 id="orgd3e7ffb"><span class="section-number-3">2.5</span> 设置阻塞/非阻塞</h3>
<div class="outline-text-3" id="text-2-5">
<blockquote>
<p>
Windows下使用 ioctlsocket 方法设置。
Linux下使用 fcntl 方法。 其函数定义在头文件 fcntl.h 中
注意：在Windows服务的模式下，Socket在connect前不能设置为nonblok的方式。
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #483d8b;">#if</span><span style="color: #483d8b;">n</span><span style="color: #483d8b;">def</span> WIN32
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">flags</span> = fcntl(sockfd, F_GETFL, 0);
    <span style="color: #0000ff;">fcntl</span>(sockfd, F_SETFL, flags | O_NONBLOCK);
<span style="color: #483d8b;">#else</span>
    <span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">mode</span> = 1;  <span style="color: #b22222;">//</span><span style="color: #b22222;">0 block; &#38750;0 nonblock </span>
    <span style="color: #0000ff;">ioctlsocket</span>(sockfd, FIONBIO, &amp;mode);
<span style="color: #483d8b;">#endif</span>
<span style="color: #b22222;">/////////////////////////////////////////////////////</span>
<span style="color: #483d8b;">#if</span><span style="color: #483d8b;">n</span><span style="color: #483d8b;">def</span> WIN32
    <span style="color: #0000ff;">fcntl</span>(sockfd, F_SETFL, flags &amp; (~O_NONBLOCK));
<span style="color: #483d8b;">#else</span>
    mode = 0;
    <span style="color: #0000ff;">ioctlsocket</span>(sockfd, FIONBIO ,&amp;mode);
<span style="color: #483d8b;">#endif</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org890cfab" class="outline-3">
<h3 id="org890cfab"><span class="section-number-3">2.6</span> 不同的错误码</h3>
<div class="outline-text-3" id="text-2-6">
<blockquote>
<p>
Linux：EWOULDBLOCK， EAGAIN 等同于 Windows下的 WSAEWOULDBLOCK 和 WSATRY_AGAIN。
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org4d8966f" class="outline-2">
<h2 id="org4d8966f"><span class="section-number-2">3</span> 获取错误码</h2>
<div class="outline-text-2" id="text-3">
<blockquote>
<p>
Windows下用GetLastError来获取错误信息。
Linux下执行失败的方法，可以用strerror(errno))获取具体的描述。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org8d8c882" class="outline-2">
<h2 id="org8d8c882"><span class="section-number-2">4</span> 多线程</h2>
<div class="outline-text-2" id="text-4">
<blockquote>
<p>
Linux下有庞大的多线程库，包括相关的互斥锁和信号量。注意编译时带上pthread库即可。
对于Windows则可以有多种选择：
</p>
</blockquote>
</div>
<div id="outline-container-org775a553" class="outline-3">
<h3 id="org775a553"><span class="section-number-3">4.1</span> pthreadVC 库</h3>
<div class="outline-text-3" id="text-4-1">
<blockquote>
<p>
是一个在Windows下实现的Linux多线程库的方法。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org185508a" class="outline-3">
<h3 id="org185508a"><span class="section-number-3">4.2</span> CreateThread</h3>
<div class="outline-text-3" id="text-4-2">
<blockquote>
<p>
微软提供的一套多线程方法。但是因为和Linux下的多线程方法使用差异明显，不建议使用。这里也不详细展开，有兴趣可以参考官方文档。
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org7650056" class="outline-3">
<h3 id="org7650056"><span class="section-number-3">4.3</span> C++ STL</h3>
<div class="outline-text-3" id="text-4-3">
<blockquote>
<p>
自从C++11开始，C++ 标准库中增加了多线程的类: std::thread，同时增加了信号量和互斥锁: std::mutex、std::condition_variable，以及一些异步方法。在C++17中更是增加了读写锁，可以很好的满足使用需求和跨平台的需求，推荐这种方法。
</p>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-org814a313" class="outline-2">
<h2 id="org814a313"><span class="section-number-2">5</span> 时间相关</h2>
<div class="outline-text-2" id="text-5">
<blockquote>
<p>
  在Linux下，当然使用大名鼎鼎的 gettimeofday() 。
对于Windows，可以用 GetTickCount() 方法。
这里还推荐C++ 中chrono中的类和方法，下面有一个小例子：
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">gettimeofday</span>(<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">timeval</span>* <span style="color: #a0522d;">tv</span>)
{
    <span style="color: #a020f0;">if</span>( tv != <span style="color: #008b8b;">NULL</span>)
    {
        <span style="color: #a020f0;">auto</span> <span style="color: #228b22;">time_now</span> = std::chrono::system_clock::now();
        std::chrono::system_clock::time_point tp = std::chrono::system_clock::now();
        <span style="color: #a020f0;">auto</span> <span style="color: #228b22;">duration_in_s</span> = std::chrono::duration_cast&lt;std::chrono::seconds&gt;(time_now.time_since_epoch()).count();
        <span style="color: #a020f0;">auto</span> <span style="color: #228b22;">duration_in_us</span> = std::chrono::duration_cast&lt;std::chrono::microseconds&gt;(time_now.time_since_epoch()).count();

        tv-&gt;tv_sec = duration_in_s;
        tv-&gt;tv_usec = duration_in_us;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7860a06" class="outline-2">
<h2 id="org7860a06"><span class="section-number-2">6</span> usleep</h2>
<div class="outline-text-2" id="text-6">
<blockquote>
<p>
windows下的sleep只能实现到秒，所以可以用类似下面的Code来实现毫秒级别的sleep:
</p>
</blockquote>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #228b22;">void</span> <span style="color: #0000ff;">usleep</span>(<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">long</span> <span style="color: #a0522d;">usec</span>)
{
    <span style="color: #228b22;">HANDLE</span> <span style="color: #a0522d;">timer</span>;
    <span style="color: #228b22;">LARGE_INTEGER</span> <span style="color: #a0522d;">interval</span>;
    interval.QuadPart = (10 * usec);

    timer = CreateWaitableTimer(<span style="color: #008b8b;">NULL</span>, TRUE, <span style="color: #008b8b;">NULL</span>);
    SetWaitableTimer(timer, &amp;interval, 0, <span style="color: #008b8b;">NULL</span>, <span style="color: #008b8b;">NULL</span>, 0);
    WaitForSingleObject(timer, INFINITE);
    CloseHandle(timer);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8bbcb4f" class="outline-2">
<h2 id="org8bbcb4f"><span class="section-number-2">7</span> Timer</h2>
<div class="outline-text-2" id="text-7">
<blockquote>
<p>
开发工作中,我们经常使用Timer来设定一个异步操作,这里涉及到多线程和精确的时间间隔,这里有一个思路是利用C++ STL的多线程和信号量来自研一个可以跨平台的Timer, 利用 std::condition_variable.wait_for()方法来定时启动。
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2020-12-04</p>
<p class="author">Author: Brook Zhang</p>
<p class="date">Created: 2020-12-04 Fri 23:42</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>